{"content":"Assistant Manager-Finance. HONG KONG. Due to continued expansion across the group, we are recruiting for an Assistant Manager - Finance in our Hong Kong office. Job purpose and overall objective: To assist the finance team in compliance with company standards, policies and procedures. Main or key responsibilities: •Supervise accounting team to oversee full set of accounts •Prepare monthly financial reports and management reporting pack with insightful analysis •Prepare balance sheet reconciliations, monitor and take follow up actions for the reconciling items •Monitor day to day cash flow and prepare cash flow forecast •Assist in budgeting and forecasting process •Support system implementation project •Liaise with different external parties such as auditors and banks •Participate in ad hoc projects assigned by senior management Coordinate with the team on any ad hoc job or project the company has to undertake •Ensure compliance with company standards, policies and procedures. Essential experience and qualifications: •Degree in accounting or related discipline •HKICPA member or equivalent •Good experience of handling accounting entries and preparing a full set of accounts •At least five years’ experience in accounting preferably gained in a MNC, of which two years managing junior staff Proficient in Microsoft Office (especially Word and Excel). Desirable experience and qualifications: •Knowledge in Microsoft Dynamics Navision would be an advantage. Personable  attributes: •Strong command of English (both verbal and written) •Able to meet deadlines and drive the team’s performance •Good team player who wants to work in an international environment •Assertive, approachable individual who can work under pressure •A self-motivated individual with a strong desire to deliver the best for the business •Possess excellent interpersonal skills •Be able to work proactively and collaboratively - as part of a team and individually •Be achievement focused whilst maintaining brand and business values •Possess a willingness to learn and share knowledge and skills with the business •Be proactive and enthusiastic and have excellent organisational skills and a methodical approach to dealing with a wide range of tasks.","annotation":{"entities":[{"text":"Assistant Manager-Finance","label":"Designation","start":0,"end":25},{"text":"HONG KONG","label":"Location","start":25,"end":34},{"text":"Assistant Manager - Finance","label":"Designation","start":104,"end":131},{"text":"Hong Kong","label":"Location","start":137,"end":146},{"text":"Job purpose and overall objective: To assist the finance team in compliance with company standards, policies and procedures","label":"Purpose","start":153,"end":276},{"text":"Main or key responsibilities: •Supervise accounting team to oversee full set of accounts •Prepare monthly financial reports and management reporting pack with insightful analysis •Prepare balance sheet reconciliations, monitor and take follow up actions for the reconciling items •Monitor day to day cash flow and prepare cash flow forecast •Assist in budgeting and forecasting process •Support system implementation project •Liaise with different external parties such as auditors and banks •Participate in ad hoc projects assigned by senior management Coordinate with the team on any ad hoc job or project the company has to undertake •Ensure compliance with company standards, policies and procedures","label":"Responsibilities","start":276,"end":980},{"text":"ssential experience and qualifications: •Degree in accounting or related discipline •HKICPA member or equivalent •Good experience of handling accounting entries and preparing a full set of accounts •At least five years’ experience in accounting preferably gained in a MNC, of which two years managing junior staff Proficient in Microsoft Office (especially Word and Excel). Desirable experience and qualifications: •Knowledge in Microsoft Dynamics Navision would be an advantage. ","label":"Qualifications","start":981,"end":1462},{"text":"Personable  attributes: •Strong command of English (both verbal and written) •Able to meet deadlines and drive the team’s performance •Good team player who wants to work in an international environment •Assertive, approachable individual who can work under pressure •A self-motivated individual with a strong desire to deliver the best for the business •Possess excellent interpersonal skills •Be able to work proactively and collaboratively - as part of a team and individually •Be achievement focused whilst maintaining brand and business values •Possess a willingness to learn and share knowledge and skills with the business •Be proactive and enthusiastic and have excellent organisational skills and a methodical approach to dealing with a wide range of tasks.","label":"Personal attributes","start":1467,"end":2232}]},{"content":"JOB TITLE: Assistant Manager, Trust Administration. POSITION REPORTS TO: Head of Trust Administration. JOB PURPOSE SUMMARY: To administer a portfolio of trusts and companies and other types of entities required by clients of Trident Trust and to provide support and assistance to other team members. KEY RESPONSIBILITIES AND ACCOUNTABILITIES/DUTIES: •To participate in the administration of client entities with integrity and to a high level of professional competence •To assist with the supervis ion and management of trust administration staff including allocation of resources, staff performance, annual appraisals , development and mentoring •To attend to clients’ requests including distributions, asset purchase or disposal, amending the Trust Deed and updating Letters of Wishes •To liaise with bankers, investment managers, agents and other professionals as necessary in the administration of client entities •To liaise with internal de partments as necessary in the administration of client entities such as compliance, business development and finance •The check all contents including trustee minutes, director’s resolutions, bank account opening forms, payment checklists, bank instructio ns etc, before arranging approval from authorised signatories •The ensure proper records are maintained and controls adhered to •To observe and reinforce internal control policies and procedures and statutory guidelines as applicable to the role •To ensure that the database is accurate and kept up to date •To ensure that file notes raised in the system are cleared by the respective administrators •To check annual financial accounts •To check annual trust reviews •To review bank advices to identify any irregular transactions and/or any injections of assets •To attend to queries in relation to trust accounting •To manage safe custody items and maintain register •To check and approve reimbursement of disbursements •To check client invoices for accuracy monitor outstanding invoices •To send out fee invoices and collect fees •To meet chargeable time requirements •To assist with me etings its regulatory requirements, including but not limited to: risk assessments, ongoing monitoring, and ongoing CDD processes •To either comply with any CPD requirements of your professional body; or where the professional body does not require CPD or the individual is not a member of a professional body, the minimum number of hours specified, if any •To observe and comply with internal policies and procedures. Skills and Competencies: •A minimum of 5 years’ experience in a trust environment •Understanding of the statutory and regulatory requirements, and best practice, for the administration of client entities from Singapore •Relevant professional qualification or ability and commitment to work towards an approved relevant professional qualification for which financial support will be offered if required •High degree of professional ethics and integrity •Ability to establish and maintain good relationships with clients and colleagues •Ability to be tactful and diplomatic and remain calm and professional when dealing with potentially difficult situations •Good analytical and reporting writing abilities •Excellent communication skills including good written and spoken English •Takes pride in their w ork with attention to detail •An outgoing personality and a good team player who is willing to help others.","annotation":{"entities":[{"text":"JOB TITLE: Assistant Manager, Trust Administration","label":"Designation","start":0,"end":50},{"text":"JOB PURPOSE SUMMARY: To administer a portfolio of trusts and companies and other types of entities required by clients of Trident Trust and to provide support and assistance to other team members. ","label":"Purpose","start":103,"end":300},{"text":"KEY RESPONSIBILITIES AND ACCOUNTABILITIES/DUTIES: •To participate in the administration of client entities with integrity and to a high level of professional competence •To assist with the supervis ion and management of trust administration staff including allocation of resources, staff performance, annual appraisals , development and mentoring •To attend to clients’ requests including distributions, asset purchase or disposal, amending the Trust Deed and updating Letters of Wishes •To liaise with bankers, investment managers, agents and other professionals as necessary in the administration of client entities •To liaise with internal de partments as necessary in the administration of client entities such as compliance, business development and finance •The check all contents including trustee minutes, director’s resolutions, bank account opening forms, payment checklists, bank instructio ns etc, before arranging approval from authorised signatories •The ensure proper records are maintained and controls adhered to •To observe and reinforce internal control policies and procedures and statutory guidelines as applicable to the role •To ensure that the database is accurate and kept up to date •To ensure that file notes raised in the system are cleared by the respective administrators •To check annual financial accounts •To check annual trust reviews •To review bank advices to identify any irregular transactions and/or any injections of assets •To attend to queries in relation to trust accounting •To manage safe custody items and maintain register •To check and approve reimbursement of disbursements •To check client invoices for accuracy monitor outstanding invoices •To send out fee invoices and collect fees •To meet chargeable time requirements •To assist with me etings its regulatory requirements, including but not limited to: risk assessments, ongoing monitoring, and ongoing CDD processes •To either comply with any CPD requirements of your professional body; or where the professional body does not require CPD or the individual is not a member of a professional body, the minimum number of hours specified, if any •To observe and comply with internal policies and procedures. ","label":"Responsibilities","start":300,"end":2511},{"text":"Skills and Competencies: •A minimum of 5 years’ experience in a trust environment •Understanding of the statutory and regulatory requirements, and best practice, for the administration of client entities from Singapore •Relevant professional qualification or ability and commitment to work towards an approved relevant professional qualification for which financial support will be offered if required","label":"Qualifications","start":2511,"end":2912},{"text":" •High degree of professional ethics and integrity •Ability to establish and maintain good relationships with clients and colleagues •Ability to be tactful and diplomatic and remain calm and professional when dealing with potentially difficult situations •Good analytical and reporting writing abilities •Excellent communication skills including good written and spoken English •Takes pride in their w ork with attention to detail •An outgoing personality and a good team player who is willing to help others.","label":"Personal attributes","start":2912,"end":3421}]},{"content":"Position: Executive Vice President, Head of Asset Management. Reports to: Group General Manager (equivalent to Chief Operations Officer). Purpose of Role: This role leads the development and implementation of asset management strategies supported by high quality asset management policies, systems and practices to achieve maximised return on investment and effective deployment of CDL’s portfolio of real estate assets that that are owned and/or managed through acquisitions, dispositions, or operations. These include assets across various asset classes in retail, commercial, industrial and residential. Responsibilities: •Develop, review and implement long-term asset management plans and strategies •Maximize total return for assets through the analysis of property efficiencies and identifying opportunities for improved performance. Monitor and report on asset performance •Provide strategic advice to Executive Committee (ExCO)to support the implementation of and adherence to effective asset management principles across CDL, both locally and overseas •Determine, in consultation with ExCO, appropriate frameworks, processes and standards to be applied to the acquisition and disposal of assets, ensuring compliance with sound financial, legal and commercial principles •Lead implementation of asset management and enhancement programmes, providing professional oversight and leadership to the asset management team activities, including business plans, budgets, forecasts, leases, valuation/ financial models, analysis and approvals etc, to protect CDL’s investments and financial interests •Responsible for profit/loss, cash flow, distribution analysis and investment projections •Develop recommendations, in consultation with relevant business units, related to CDL’s portfolio profile, deployment and redeployment, acquisition, disposal or retirement of assets. Requirements: •Minimally a recognized Degree in Business, Real Estate and/or Finance related disciplines •Minimum 15 years of relevant experience with at least 5 years in a similar leadership capacity •Diversified asset management experience across retail, commercial, industrial and residential properties •Excellent proven track record in the areas of asset management, enhancement and financial results •Self-motivated and able to work independently in a goal-driven, fast paced environment •Strong leadership, analytical and negotiation skills •Effective oral and written communication skills with ability to present strategies, recommendations and decisions in a well-reasoned, well-contented manner •Must be prepared and willing to travel.","annotation":{"entities":[{"text":"Position: Executive Vice President","label":"Designation","start":0,"end":34},{"text":"Head of Asset Management","label":"Designation","start":36,"end":60},{"text":"Purpose of Role: This role leads the development and implementation of asset management strategies supported by high quality asset management policies, systems and practices to achieve maximised return on investment and effective deployment of CDL’s portfolio of real estate assets that that are owned and/or managed through acquisitions, dispositions, or operations. These include assets across various asset classes in retail, commercial, industrial and residential. ","label":"Purpose","start":138,"end":607},{"text":"Responsibilities: •Develop, review and implement long-term asset management plans and strategies •Maximize total return for assets through the analysis of property efficiencies and identifying opportunities for improved performance. Monitor and report on asset performance •Provide strategic advice to Executive Committee (ExCO)to support the implementation of and adherence to effective asset management principles across CDL, both locally and overseas •Determine, in consultation with ExCO, appropriate frameworks, processes and standards to be applied to the acquisition and disposal of assets, ensuring compliance with sound financial, legal and commercial principles •Lead implementation of asset management and enhancement programmes, providing professional oversight and leadership to the asset management team activities, including business plans, budgets, forecasts, leases, valuation/ financial models, analysis and approvals etc, to protect CDL’s investments and financial interests •Responsible for profit/loss, cash flow, distribution analysis and investment projections •Develop recommendations, in consultation with relevant business units, related to CDL’s portfolio profile, deployment and redeployment, acquisition, disposal or retirement of assets. ","label":"Responsibilities","start":607,"end":1875},{"text":"Requirements: •Minimally a recognized Degree in Business, Real Estate and/or Finance related disciplines •Minimum 15 years of relevant experience with at least 5 years in a similar leadership capacity •Diversified asset management experience across retail, commercial, industrial and residential properties •Excellent proven track record in the areas of asset management, enhancement and financial results •","label":"Qualifications","start":1875,"end":2282},{"text":"Self-motivated and able to work independently in a goal-driven, fast paced environment •Strong leadership, analytical and negotiation skills •Effective oral and written communication skills with ability to present strategies, recommendations and decisions in a well-reasoned, well-contented manner •Must be prepared and willing to travel.","label":"Personal attributes","start":2282,"end":2621}]},{"content":"Role: Fund Accountant. Company: CITCO Funds Services. Website: https://www.citco.com. Your role will encompass all facets of the calculation of net asset values on a variety of complex hedge funds. Working closely with the senior fund accountants, supervisors and (Senior)/account managers, your responsibilities will include: Job Responsibilities: •Performing the administration of and any services pursuant to administration agreements in respect of a portfolio of hedge funds •Initially assisting with the preparation of Net Asset Value calculations, financial statements and associated reports with a view to operate independently within deadlines •Performing daily &amp; monthly reconciliations for hedge funds •Working with the Investor Relations group oMeeting expectations of fund participants, adhering to deadlines •Maintaining day-to-day relationships with investors, investment advisors/managers, banks, brokers and auditors and other fund participants •Assisting auditors and other advisers, preparing Annual Reports oAssisting Supervisor and Account Manager where required. Requirements: •Degree qualified in Accounting or Finance related area oIdeally 1- 2 years experience in a Fund Accounting environment, preferably hedge funds •Display an active interest in the financial markets and hedge fund industry •Proficient in Microsoft Applications (Word, Excel etc).","annotation":{"entities":[{"text":"Role: Fund Accountant","label":"Designation","start":0,"end":21},{"text":"Company: CITCO Funds Services","label":"Company","start":23,"end":52},{"text":"role will encompass all facets of the calculation of net asset values on a variety of complex hedge funds. ","label":"Purpose","start":91,"end":198},{"text":"Job Responsibilities: •Performing the administration of and any services pursuant to administration agreements in respect of a portfolio of hedge funds •Initially assisting with the preparation of Net Asset Value calculations, financial statements and associated reports with a view to operate independently within deadlines •Performing daily &amp; monthly reconciliations for hedge funds •Working with the Investor Relations group oMeeting expectations of fund participants, adhering to deadlines •Maintaining day-to-day relationships with investors, investment advisors/managers, banks, brokers and auditors and other fund participants •Assisting auditors and other advisers, preparing Annual Reports oAssisting Supervisor and Account Manager where required. ","label":"Responsibilities","start":327,"end":1088},{"text":"Requirements: •Degree qualified in Accounting or Finance related area oIdeally 1- 2 years experience in a Fund Accounting environment, preferably hedge funds","label":"Qualifications","start":1088,"end":1245},{"text":" •Display an active interest in the financial markets and hedge fund industry","label":"Personal attributes","start":1245,"end":1322},{"text":" •Proficient in Microsoft Applications (Word, Excel etc).","label":"Qualifications","start":1322,"end":1379}]},{"content":"Job Title: Fund Accountant (Private Equity). Reports to: Assistant Vice President. Department: Fund Accounting. Location: Singapore. Company Overview: Citco Fund Services is a division of the Citco Group of Companies and is one of the largest independent fund administrator in the world with offices in Amsterdam, Bahamas, Bermuda, Cayman Islands, Cork, Curacao, Dublin, Halifax, London, Luxembourg, Malvern, Miami, New York/New Jersey, Toronto, San Francisco, Singapore and Sydney. Citco Fund Services (Singapore) Pte Ltd. has been operating successfully since March 2007 and established itself as a market leader in fund administration. We offer a complete range of accounting, middle office administration, shareholder and corporate services to hedge funds, private equity funds and real estate funds. Position Overview: The Fund Accountant (Private Equity) is responsible for providing clients with accurate and timely accounting services in line with clients’ business needs, Citco procedures, applicable accounting standards and compliance with relevant regulatory authorities, to meet the client service agreements. The challenge will be to operate in a professional and pressurized environment to meet the demands of our clients. The successful candidate will have the motivation and ability to thrive in a challenging and constantly evolving industry. Main Job Functions/Responsibilities: •Accounting & analysis oMaintain and control the general ledger and various sub-ledgers oPrepare financial statements, footnotes and partner capital statements oPrepare limited partner and general partner allocations oPrepare trial balances and work paper product oProcess standard and complex bookkeeping entries oInvolved within a full scope of transaction activities including full cycle accounting oPrepare financial data analysis •Monitor the timing and quality of client deliverables •Interact with Management and Clients •Review private equity fund client’s partnership agreements, PPM’s and other materials •Participate in the implementation of fund structures onto the accounting system •Monitor compliance of various agreements with clients, including the Service Level Agreement •Operate as a contact point for clients; able to respond to and resolve queries or escalate where necessary •Act as a liaison with various internal /external parties – i.e. auditors, legal counsel •Assist in client audit procedures •Process wire transfer payments on behalf of clients •Maintain complex Excel spreadsheets •Liaise with property management companies. Education: •Bachelor’s degree in accounting •Designated accountant or working towards CA, CMA, CGA, CPA designation. Qualifications: •1+ years of public/private real estate accounting work experience •Knowledge of IFRS and/or US GAAP •Excellent communication skills and proficiency in English (both verbal and written) •Motivated, bright and diligent individual who is driven to meet deadlines •A team player who is able to manage individual responsibilities •Sound judgment, problem solving and analytical skills •Advanced level MS Excel •Proficient with MS Word, MS PowerPoint. Desired Qualifications: •Knowledge of MRI, Yardi, or Investran a plus •Experience in Limited Partnership accounting a plus •Private equity/real estate fund administration experience a plus •Knowledge of REIT structures a plus •Performance Reporting – NCREIF, INREV/ANREV and GIPS(AIMR). Key Competencies: •Business & Commercial Awareness •Quality & Risk Control •Problem Solving •Client Service •Communication •Teamwork •Adaptability •Drive for Results.","annotation":{"entities":[{"text":"Job Title: Fund Accountant (Private Equity). ","label":"Designation","start":0,"end":45},{"text":"Singapore","label":"Location","start":122,"end":131},{"text":"Citco Fund Services","label":"Company","start":151,"end":170},{"text":"Position Overview: The Fund Accountant (Private Equity) is responsible for providing clients with accurate and timely accounting services in line with clients’ business needs, Citco procedures, applicable accounting standards and compliance with relevant regulatory authorities, to meet the client service agreements. The challenge will be to operate in a professional and pressurized environment to meet the demands of our clients. ","label":"Purpose","start":805,"end":1238},{"text":"Main Job Functions/Responsibilities: •Accounting & analysis oMaintain and control the general ledger and various sub-ledgers oPrepare financial statements, footnotes and partner capital statements oPrepare limited partner and general partner allocations oPrepare trial balances and work paper product oProcess standard and complex bookkeeping entries oInvolved within a full scope of transaction activities including full cycle accounting oPrepare financial data analysis •Monitor the timing and quality of client deliverables •Interact with Management and Clients •Review private equity fund client’s partnership agreements, PPM’s and other materials •Participate in the implementation of fund structures onto the accounting system •Monitor compliance of various agreements with clients, including the Service Level Agreement •Operate as a contact point for clients; able to respond to and resolve queries or escalate where necessary •Act as a liaison with various internal /external parties – i.e. auditors, legal counsel •Assist in client audit procedures •Process wire transfer payments on behalf of clients •Maintain complex Excel spreadsheets •Liaise with property management companies. Education: •Bachelor’s degree in accounting •Designated accountant or working towards CA, CMA, CGA, CPA designation. ","label":"Responsibilities","start":1361,"end":2671},{"text":"Qualifications: •1+ years of public/private real estate accounting work experience •Knowledge of IFRS and/or US GAAP •Excellent communication skills and proficiency in English (both verbal and written) •","label":"Qualifications","start":2671,"end":2874},{"text":"Motivated, bright and diligent individual who is driven to meet deadlines •A team player who is able to manage individual responsibilities •Sound judgment, problem solving and analytical skills","label":"Personal attributes","start":2874,"end":3067},{"text":" •Advanced level MS Excel •Proficient with MS Word, MS PowerPoint. Desired Qualifications: •Knowledge of MRI, Yardi, or Investran a plus •Experience in Limited Partnership accounting a plus •Private equity/real estate fund administration experience a plus •Knowledge of REIT structures a plus •Performance Reporting – NCREIF, INREV/ANREV and GIPS(AIMR). ","label":"Qualifications","start":3067,"end":3421},{"text":"Key Competencies: •Business & Commercial Awareness •Quality & Risk Control •Problem Solving •Client Service •Communication •Teamwork •Adaptability •Drive for Results.","label":"Personal attributes","start":3421,"end":3587}]}